In [1]:
from pandas import DataFrame

In [2]:
data={'Name':['ram','bijil','tom'],
     'Age':[12,56,78],
     'Salary':[123,567,890]}

In [3]:
frame=DataFrame(data)

In [4]:
frame

    Name  Age  Salary
0    ram   12     123
1  bijil   56     567
2    tom   78     890

In [5]:
new_frame=DataFrame(data,columns=['Name','Salary','Age'])

In [6]:
new_frame

    Name  Salary  Age
0    ram     123   12
1  bijil     567   56
2    tom     890   78

In [7]:
new_frame['Salary']

0    123
1    567
2    890
Name: Salary, dtype: int64

In [9]:
new_frame.loc[2]

Name      tom
Salary    890
Age        78
Name: 2, dtype: object

In [10]:
new_frame['Profile']='Doctor'

In [11]:
new_frame

    Name  Salary  Age Profile
0    ram     123   12  Doctor
1  bijil     567   56  Doctor
2    tom     890   78  Doctor

In [13]:
new_frame['edu']='msc'

In [14]:
new_frame

    Name  Salary  Age Profile  edu
0    ram     123   12  Doctor  msc
1  bijil     567   56  Doctor  msc
2    tom     890   78  Doctor  msc

In [15]:
new_frame.T

              0       1       2
Name        ram   bijil     tom
Salary      123     567     890
Age          12      56      78
Profile  Doctor  Doctor  Doctor
edu         msc     msc     msc

In [18]:
from pandas import Series
obj=Series([100,200,300,400,500],index=['a','d','b','c','f'])

In [19]:
obj

a    100
d    200
b    300
c    400
f    500
dtype: int64

In [20]:
obj=obj.reindex(['a','b','c','d','f'])

In [21]:
obj

a    100
b    300
c    400
d    200
f    500
dtype: int64

In [22]:
frame

    Name  Age  Salary
0    ram   12     123
1  bijil   56     567
2    tom   78     890

In [23]:
frame=frame.reindex([0,2,1])
frame

    Name  Age  Salary
0    ram   12     123
2    tom   78     890
1  bijil   56     567